tutorials/multiphase/multiphaseEulerFoam/RAS/bubblePipe/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    massSource
    {
        type            semiImplicitSource;

        selectionMode   cellZone;
        cellZone        injection;

        volumeMode      absolute;

        sources
        {
            thermo:rho.air1
            {
                explicit    6e-07;
                implicit    0;
            }

            f3.air1.bubbles
            {
                value       1.0;
                explicit    #calc "$value*$../thermo:rho.air1/explicit";
                implicit    0;
            }
        }
    }
}
